# Pandas recap

## Exercise 1

Follow this [link](https://urledu-my.sharepoint.com/:u:/g/personal/jordi_nin_esade_edu/EbBCNJquv19Kgodi0wTJ-HQByq5HWz3bct5xpMuyn1a2ew?e=b7aLtL) to download a dataset containing information about alcoholic beverage consumption in different regions. The dataset is presented in a csv format. You might need to unzip it.

The data contain the following attributes:

* country
* beer_servings
* spirit_servigs
* wine_servings
* total_litres_of_pure_alcohol
* continent 

#### Exercise 1.1

Create a dataframe called ```data``` from the provided csv data.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("/data/client-files/jessica/prod/drinks.csv")

In [3]:
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

#### Exercise 1.2

Write the code to identify the continent for which the sum of ```total_litres_of_pure_alcohol``` is maximum.

In [4]:
df["total_litres_of_pure_alcohol"]

0       0.0
1       4.9
2       0.7
3      12.4
4       5.9
       ...
188     7.7
189     2.0
190     0.1
191     2.5
192     4.7
Name: total_litres_of_pure_alcohol, Length: 193, dtype: float64

In [5]:
grouped = df.groupby("continent")
grouped["total_litres_of_pure_alcohol"].sum()

continent
AF    159.4
AS     95.5
EU    387.8
OC     54.1
SA     75.7
Name: total_litres_of_pure_alcohol, dtype: float64

In [6]:
df.groupby(["continent"])["total_litres_of_pure_alcohol"].sum().max()

387.79999999999995

#### Exercise 1.3

Write the code to identify those European countries where wine is served more than beer

In [7]:
df[(df["continent"] == "EU") & (df["beer_servings"] < df["wine_servings"])]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
3,Andorra,245,138,312,12.4,EU
42,Croatia,230,87,254,10.2,EU
48,Denmark,224,81,278,10.4,EU
61,France,127,151,370,11.8,EU
64,Georgia,52,100,149,5.4,EU
67,Greece,133,112,218,8.3,EU
83,Italy,85,42,237,6.5,EU
99,Luxembourg,236,133,271,11.4,EU
113,Montenegro,31,114,128,4.9,EU
136,Portugal,194,67,339,11.0,EU
156,Slovenia,270,51,276,10.6,EU
165,Sweden,152,60,186,7.2,EU
166,Switzerland,185,100,280,10.2,EU

In [8]:
eu_countries = df[df["continent"]=="EU"]

In [ ]:
eu_countries[eu_countries["beer_servings"]< eu_countries["wine_servings"]]

#### Exercise 1.4

List the five countries with more servings in total, computed as the sum of wine, beer and spirit servings.

In [ ]:
df["total"] = df["beer_servings"]+df["spirit_servings"]+df["wine_servings"]

In [ ]:
df.nlargest(5,["total"])

In [ ]:
df.sort_values("total", ascending= False).head()

## Exercise 2

Follow this [link](https://urledu-my.sharepoint.com/:u:/g/personal/jordi_nin_esade_edu/EUxpZomwa3dFheR7863EVk8BuSM1O057YgthkWE5PrKHdg?e=hpDNVA) to download a dataset containing information about the census in the city of Barcelona. The dataset is presented in a csv format. You might need to unzip it. 

Each row in this dataset represents a different census cubicle and is identified by its corresponding ```idsection```. For each cubicle, we have information about the neighborhood and district each census tract belongs (columns ```idneighb```, ```tneighb```, ```iddistrict```, ```tdistrict```). In addition, we also have the following geographic, economic and demographic information:

* surface_m2: surface (in m2) of the census section
* income: average monthly net incomes by household
* population: total population in the census section
* men / women: total number of men and women in the census section, respectively
* pop_*: total number of inhabitants in the indicated age brackets

#### Exercise 2.1

Create a dataframe called ```df``` that stores the information in the provided dataset.

In [ ]:
df = pd.read_csv("/data/client-files/jessica/prod/barcelona_data_pre.csv")

In [ ]:
df

#### Exercise 2.2

Create a new column called ```pop_density``` with the population density in inhabitants by hectare (inhab/ha) for each cubicle. Note: 1 hectare equals 10.000 square meters.

In [ ]:
df["pop_density"] = df["population"] / df["surface_m2"] * 10_000

In [ ]:
df.head()

#### Exercise 2.3

Create a new dataframe called ```most-pop``` that contains only those cubicles with a population density greater than 900 inhab/ha. Create a new dataframe named (most_pop) with them.

In [ ]:
most_pop = df[df["pop_density"] >900]

In [ ]:
most_pop.head()

#### Exercise 2.4
Write the code to identify the neighborhood where the denser census cubicle is located

In [ ]:
df.groupby(["tneighb"])["pop_density"].sum().nlargest(1)

#### **Exercise 2.5**
Write the code to compute the population density by district in inhabitants by hectare.

In [ ]:
district_sum = df.groupby(["tdistrict"]).sum()

In [ ]:
district_sum.groupby(["tneighb"])["pop_density"].sum().nlargest(1)

In [ ]:
district_sum["district_pop_density"] = district_sum["population"] / district_sum["surface_m2"] * 10_000

In [ ]:
district_sum["district_pop_density"]

#### **Exercise 2.6**

Create a new column ```income_per_person``` with the income per person for each cubicle. Note: although the incomes are given by household, you can assume that they are actually per person.

In [ ]:
# correct? see next cell
df["income_per_person"] = df["income"] / df["population"]

#### **Exercise 2.7**

Write the code to identify the cubicles with a ```income_per_person``` greater than 1.000 euros and with more than 3000 inhabitants.

In [ ]:
# note > 0

df[(df["income_per_person"] > 0) & (df["population"] > 3000)][['idsection','income_per_person','population']]

#### **Exercise 2.8**

Write the code to identify the cublice with the larger average income.

In [ ]:
df[(df["income"] > df["income"].mean())][['idsection','income','population']]

#### **Exercise 2.9**

Write the code to limit the ```income``` column to a maximum value of 5000€.

In [ ]:
df[(df["income"] <= 5000)][['idsection','income','population']]

## Exercise 3

Follow this [link](https://urledu-my.sharepoint.com/:u:/g/personal/jordi_nin_esade_edu/EecC8IKo5dtBhmZTGKObe94BwcefmbK8__aJVkoOjcO7JQ?e=vFwvtd) to download a dataset containing information about different family structures. The data are presented in a csv format. You might need to unzip it. 

The dataset contains the following attributes:

* gender
* num_children
* income
* social_class

#### Exercise 3.1

Create a dataframe called ```df``` that contains the provided data

In [ ]:
df = pd.read_csv("social_class.csv")

In [ ]:
df

#### Exercise 3.2

Write the code to identify those rows for which the ```social_class``` is ```Upper```.

In [ ]:
df[df["social_class"]== "Upper"]

#### **Exercise 3.3**

Write the code to print out the ```social_class``` frequency table

In [ ]:
df['social_class'] = df['social_class'].astype('category')

In [ ]:
df['social_class_2'] = df['social_class'].cat.codes

In [ ]:
df["social_class_2"]

#### Exercise 3.4

Write the code to compute the average income and num_children for each ```social_class```

In [ ]:
df.groupby(["social_class"])["income","num_children"].mean()

#### Exercise 3.5

Write the code to crate a new column called ```children``` that containg False if the family has no children and True otherwise

In [ ]:
df["children"] =df["num_children"]> 0

In [ ]:
df

## Exercise 4

Follow this [link](https://urledu-my.sharepoint.com/:u:/g/personal/jordi_nin_esade_edu/Ef8OhH5vmgNPhaLIEWw5U7gBCgHV9sASNWxxw8BFUcZk6g?e=ngxpRg) to download a dataset containing information about labour occupation in the US. The data re represented in a csv format. You might need to unzip it.

Expert say that in the near future US will enter in a recession period. To verify this statement, we have the following attributes:

* user_id
* age
* gender
* occupation
* zip_code

#### Exercise 4.1

Create a dataframe called ```data``` that stores the provided data.

In [ ]:
data = pd.read_csv("occupation.csv")

In [ ]:
data

#### Exercise 4.2

Write the code to compute the average ```age``` by ```gender```

In [ ]:
data.groupby(["gender"])["age"].mean()

#### **Exercise 4.3**

Write the code to identify the two least common occupations

#### **Exercise 4.4.**

Write the code to identify the row corresponding to the oldest worker ith occupation equal to homemaker